Revit 2027 API
Group.UngroupMembers Method
Ungroups the group.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> UngroupMembers()
Public Function UngroupMembers As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ UngroupMembers()
member UngroupMembers : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
If successful, the ids of the members of group are returned.
Exceptions
Exception | Condition
InvalidOperationException | Thrown if the group cannot be ungrouped.
Remarks
Removes all the members from the group and deletes the group. Note that the reference to this group object will become invalid once this method is called.
See Also
Reference
Group Class
Autodesk.Revit.DB Namespace